xml/InformationRegisters/ДоходностиОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДоходностиОблигаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КПогашению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Купонная</Name>
					<Comment>Купон/(цена+НКД)*360/Купоныйпериод</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/КупоныОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КупоныОблигаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/НоминалыОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НоминалыОблигаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНоминала</Name>
					<Comment>Непогашенный долг, Текущий номинал</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/Котировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Котировки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗакрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСредневзвеш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ОфертыОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ОфертыОблигаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОферты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОферты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВыкупа</Name>
					<Comment>%</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ЗагрузкаБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЗагрузкаБумаг</Name>
			<Comment>Для заполнения динамического списка при загрузке бумаг</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрошлая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаТекущая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаОферты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоходности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/РаботаСРегистрами/Ext/Module.bsl
Процедура СоздатьДоходностьОблигации(ЦБСсылка, Дата, КПогашению, Купонная) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДоходностиОблигаций.СоздатьМенеджерЗаписи();
		
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	//МенеджерЗаписи.Прочитать();
	
	//Если МенеджерЗаписи.ЦБ.Пустая() Тогда // Записи нет еще
	//
	//	МенеджерЗаписи.ЦБ = ЦБСсылка;
	//	МенеджерЗаписи.Период = Дата;
	//
	//КонецЕсли; 
	
	//Если КПогашению<>Неопределено Тогда
		МенеджерЗаписи.КПогашению = КПогашению;
	//КонецЕсли; 
	
	//Если Купонная<>Неопределено Тогда
		МенеджерЗаписи.Купонная = Купонная;
	//КонецЕсли; 


	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьКупон(ЦБСсылка, ДатаКупона, РазмерКупона) Экспорт

	Если ДатаКупона=Дата(1,1,1) Тогда
		Возврат; 	
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.КупоныОблигаций.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = ДатаКупона;
	МенеджерЗаписи.СуммаКупона = РазмерКупона;

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьНоминалОблигации(ЦБСсылка, Дата, СуммаНоминала) Экспорт

	Отбор = Новый Структура("ЦБ", ЦБСсылка); 
	ПредыдущийНоминал = РегистрыСведений.НоминалыОблигаций.ПолучитьПоследнее(Дата,Отбор).СуммаНоминала;
	
	Если ПредыдущийНоминал<>СуммаНоминала Тогда
	
		МенеджерЗаписи = РегистрыСведений.НоминалыОблигаций.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ЦБ = ЦБСсылка;
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.СуммаНоминала = СуммаНоминала;

		МенеджерЗаписи.Записать();
	
	КонецЕсли; 
	

КонецПроцедуры


Процедура СоздатьКотировку(ЦБСсылка, Дата, Цена, ЦенаЗакрытия=0, ЦенаСредневзвеш=0, НКД=0) Экспорт

	МенеджерЗаписи = РегистрыСведений.Котировки.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.ЦенаЗакрытия = ЦенаЗакрытия;
	МенеджерЗаписи.ЦенаСредневзвеш = ЦенаСредневзвеш;
	МенеджерЗаписи.НКД = НКД;

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьОферту(ЦБСсылка, Дата, ТипОферты=Неопределено, ЦенаВыкупа=Неопределено) Экспорт

	МенеджерЗаписи = РегистрыСведений.ОфертыОблигаций.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.ЦБ.Пустая() Тогда // Записи нет еще
	
		МенеджерЗаписи.ЦБ = ЦБСсылка;
		МенеджерЗаписи.Период = Дата;
	
	КонецЕсли; 
	
	Если ТипОферты<>Неопределено Тогда
		МенеджерЗаписи.ТипОферты = ТипОферты;
	КонецЕсли; 
	
	Если ЦенаВыкупа<>Неопределено Тогда
		МенеджерЗаписи.ЦенаВыкупа = ЦенаВыкупа;
	КонецЕсли; 

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ОчиститьЗагрузкуБумаг() Экспорт

	НаборЗаписей = РегистрыСведений.ЗагрузкаБумаг.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры
 
Процедура ОбъеденитьЭмитентов(СписокЭмитентов, ОсновнойЭмитент=Неопределено) Экспорт

	// Получить список заменяемых эмитентов
	
	Если ОсновнойЭмитент=Неопределено Тогда
		ОсновнойЭмитент = СписокЭмитентов[0];	
	КонецЕсли;
	
	ЗаменяемыеЭмитенты = Новый Массив;
	
	Для каждого Эмитент Из СписокЭмитентов Цикл
	
		Если Эмитент<>ОсновнойЭмитент Тогда
		
			ЗаменяемыеЭмитенты.Добавить(Эмитент);	
		
		КонецЕсли; 	
	
	КонецЦикла;
	
	// Заменить
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦенныеБумаги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
		|ГДЕ
		|	ЦенныеБумаги.Эмитент В(&СписокЭмитентов)";
	
	Запрос.УстановитьПараметр("СписокЭмитентов", ЗаменяемыеЭмитенты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЦБОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЦБОбъект.Эмитент = ОсновнойЭмитент;
		ЦБОбъект.Записать();
	КонецЦикла;
	
	// Удалить
	
	Для каждого Эмитент Из ЗаменяемыеЭмитенты Цикл
	
		//Эмитент = Справочники.Эмитенты.НайтиПоКоду("ав");
		Об = Эмитент.ПолучитьОбъект();	
		Об.Удалить();
	КонецЦикла; 
	

КонецПроцедуры
